src/InformationRegisters/ar_Запуски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_Запуски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_СтатусЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтветLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_АгентРеф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_Агенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтартовалВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЗавершенВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Триггер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПользовательРеф</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВыход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтоимостьРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ШаговВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_РодительскийИдентификаторЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_StateSnapshot</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПоследнийПульс</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПрофильЗапуска</Name>
					<Comment>Профиль запуска (CONS-01), определивший ответственного и область данных этого запуска. Пустая ссылка — профиль не указан (обратная совместимость, CONS-02).</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_ПрофилиЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПопытокВозобновления</Name>
					<Comment>Счётчик повторов техсбоя (§3.5) и предохранитель третьего слоя детекции прогресса — потолок 10 продолжений (§3.3, CONS-11). Заполняется ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПродолженийСделано</Name>
					<Comment>CONS-11: счётчик фактических продолжений цикла по вердикту Продолжить надзора (§3.3) — предохранитель слоя 3, потолок 10. НЕ путать с ar_ПопытокВозобновления (CONS-09, счётчик техповторов, потолок 3) — разные счётчики по решению аналитика/оркестратора, во избежание рассинхрона двух независимых механизмов. Не сбрасывается при автовозобновлении техсбоя (ar_Планировщик.ОбработатьАвтовозобновление).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПоследнееРешениеНадзора</Name>
					<Comment>Каноническое имя значения ar_ВердиктНадзора (или пусто, если надзор ещё не вызывался) — хранится строкой, а не ссылкой на перечисление, чтобы консоль показывала решение без join (план §5.1). Заполняется ar_Надзор (CONS-10).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтпечатокШага</Name>
					<Comment>Хэш «имя tool + хэш аргументов + хэш результата» последнего шага — основа result-aware детекции застревания (§3.3, CONS-11). 64 символа — под hex SHA-256.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПовторитьПосле</Name>
					<Comment>Момент следующей попытки при временном техсбое (сеть, таймаут, 429/5xx); пусто — повтор не запланирован (§3.5). Читает и пишет ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТекущийЭтап</Name>
					<Comment>PLAN-01: название текущего этапа плана (заголовок пункта) — для быстрого отображения без join (план §5.1). Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.ТекущийПункт (PLAN-02, пока не реализован). Полный план не хранится в регистре — восстанавливается из последнего события PlanUpdated в ar_СобытияЗапуска. Пусто для запусков без плана.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповВсего</Name>
					<Comment>PLAN-01: общее количество этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповЗакрыто</Name>
					<Comment>PLAN-01: количество завершённых этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжидаетСобытия</Name>
					<Comment>PLAN-10: JSON-строка вида {\"object_type\": \"Справочник.Контрагенты\", \"filter\": {\"Наименование\": \"ООО Ромашка\"}} - тип объекта + плоский фильтр без операторов, по аналогии с ar_ОбработчикПодписок.ГорячиеТипы/ПроверитьФильтр. Заполняется ar_RuntimeЦикл/ar_ИнструментыПлан при вызове tool wait_for_event(object_type, filter, deadline_hours) (PLAN-11, пока не реализован). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжиданиеДо</Name>
					<Comment>PLAN-10: дедлайн ожидания события, DateTime (точность до секунды - deadline_hours в часах, PLAN-11). Заполняется ar_RuntimeЦикл при вызове tool wait_for_event как ТекущаяДата() + deadline_hours часов (PLAN-11, пока не реализован). Сравнивается с ТекущаяДата() в регламентном задании проверки дедлайна (PLAN-13). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Диалог</Name>					<Type>
						<v8:Type>cfg:CatalogRef.ar_Диалоги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Предмет</Name>					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_ИдентификаторЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ar_ЛентаДиалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_ЛентаДиалога</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_Момент</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ВидСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_ВидыСообщенийДиалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Запуск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ИдентификаторВопроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ВариантыОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтветВыбранИзВариантов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжидаетОбработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_Диалог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_Диалоги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ar_Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ar_ВидыСообщенийДиалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_ВидыСообщенийДиалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вопрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ответ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеАгента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Служебное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ar_ВидыДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_ВидыДиалогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Чат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВопросыАгента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ar_СостоянияДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_СостоянияДиалогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершён</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Истёк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ar_ДиалогиСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_ДиалогиСервер (ядро диалогов агент - пользователь).
//
// Единственное место записи и чтения ленты (ar_ЛентаДиалога) и шапок
// диалогов (Справочник.ar_Диалоги). Формы (ar_Диалог, формы справочника
// ar_Диалоги) работают с лентой только через этот модуль.
//
// Ключ ленты: измерение ar_Диалог (ссылка на ar_Диалоги) и номер сообщения.
//
// Права (спека п.19): экспортные процедуры, которые читают ленту, принимают
// сообщение или строят список, работают в привилегированном режиме и первым
// действием проверяют доступ: участник диалога, инициатор чата либо
// оператор/администратор/полные права (читатель - только чтение чата).
//
// Чат консоли (запуски с триггером manual_chat / manual_chat_no_agent) ядром
// диалогов «Вопросы агента» не обслуживается: диалог не создаётся и не ищется.
//
// Свойства модуля: Сервер, без вызова с клиента, Привилегированный = Ложь.
// Запрещено: Выполнить(), Вычислить().
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Соответствие «строковая роль чата → вид сообщения» (спека п.5). Роли формы чата:
// user, assistant, tool, ask_user, system; tool_result и status - синонимы.
//
// Возвращаемое значение:
//  Соответствие - Роль (Строка) → ПеречислениеСсылка.ar_ВидыСообщенийДиалога.
//
Функция РолиЧата() Экспорт

	Роли = Новый Соответствие;
	Роли.Вставить("user",        Перечисления.ar_ВидыСообщенийДиалога.СообщениеПользователя);
	Роли.Вставить("assistant",   Перечисления.ar_ВидыСообщенийДиалога.СообщениеАгента);
	Роли.Вставить("tool",        Перечисления.ar_ВидыСообщенийДиалога.РезультатИнструмента);
	Роли.Вставить("tool_result", Перечисления.ar_ВидыСообщенийДиалога.РезультатИнструмента);
	Роли.Вставить("ask_user",    Перечисления.ar_ВидыСообщенийДиалога.Вопрос);
	Роли.Вставить("system",      Перечисления.ar_ВидыСообщенийДиалога.Служебное);
	Роли.Вставить("status",      Перечисления.ar_ВидыСообщенийДиалога.Служебное);
	Возврат Роли;

КонецФункции

// Вид сообщения по строковой роли чата. Незнакомая роль → Служебное.
//
Функция ВидСообщенияПоРоли(Знач Роль) Экспорт

	Вид = РолиЧата().Получить(СокрЛП(Роль));
	Возврат ?(Вид = Неопределено,
		Перечисления.ar_ВидыСообщенийДиалога.Служебное, Вид);

КонецФункции

// Строковая роль формы чата по виду сообщения (ответ человека - "user").
// Незнакомый вид → "system".
//
Функция РольПоВидуСообщения(Знач ВидСообщения) Экспорт

	Если ВидСообщения = Перечисления.ar_ВидыСообщенийДиалога.СообщениеПользователя
		Или ВидСообщения = Перечисления.ar_ВидыСообщенийДиалога.Ответ Тогда
		Возврат "user";
	ИначеЕсли ВидСообщения = Перечисления.ar_ВидыСообщенийДиалога.СообщениеАгента Тогда
		Возврат "assistant";
	ИначеЕсли ВидСообщения = Перечисления.ar_ВидыСообщенийДиалога.РезультатИнструмента Тогда
		Возврат "tool";
	ИначеЕсли ВидСообщения = Перечисления.ar_ВидыСообщенийДиалога.Вопрос Тогда
		Возврат "ask_user";
	КонецЕсли;
	Возврат "system";

КонецФункции

// Диалог по якорю чата (ar_Якорь, например "chat:<UUID>"); пустая ссылка, если нет.
//
Функция ДиалогПоЯкорю(Знач Якорь) Экспорт

	Если ТипЗнч(Якорь) <> Тип("Строка") Или ПустаяСтрока(СокрЛП(Якорь)) Тогда
		Возврат Справочники.ar_Диалоги.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Диалоги.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ar_Диалоги КАК Диалоги
		|ГДЕ
		|	Диалоги.ar_Якорь = &Якорь";
	Запрос.УстановитьПараметр("Якорь", СокрЛП(Якорь));

	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Справочники.ar_Диалоги.ПустаяСсылка());

КонецФункции

// Запуск - чат консоли (триггер manual_chat / manual_chat_no_agent): ядро
// диалогов «Вопросы агента» такие запуски не обслуживает (спека п.6).
//
Функция ЭтоЧатКонсоли(Знач RunId) Экспорт

	Триггер = "";

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Запуски.ar_Триггер КАК Триггер
			|ИЗ
			|	РегистрСведений.ar_Запуски КАК Запуски
			|ГДЕ
			|	Запуски.ar_ИдентификаторЗапуска = &RunId";
		Запрос.УстановитьПараметр("RunId", СокрЛП(RunId));

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Триггер = СокрЛП(Выборка.Триггер);
		КонецЕсли;
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат СтрНачинаетсяС(Триггер, "manual_chat");

КонецФункции

// Диалог запуска: ar_Запуски.ar_Диалог, иначе справочник по ar_Запуск = RunId.
// Для чата консоли возвращает пустую ссылку (спека п.6).
//
Функция ДиалогЗапуска(Знач RunId) Экспорт

	ПустойДиалог = Справочники.ar_Диалоги.ПустаяСсылка();
	Если ТипЗнч(RunId) <> Тип("Строка") Или ПустаяСтрока(СокрЛП(RunId)) Тогда
		Возврат ПустойДиалог;
	КонецЕсли;

	Если ЭтоЧатКонсоли(RunId) Тогда
		Возврат ПустойДиалог;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Запуски.ar_Диалог КАК Диалог
			|ИЗ
			|	РегистрСведений.ar_Запуски КАК Запуски
			|ГДЕ
			|	Запуски.ar_ИдентификаторЗапуска = &RunId
			|	И Запуски.ar_Диалог <> ЗНАЧЕНИЕ(Справочник.ar_Диалоги.ПустаяСсылка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Диалоги.Ссылка
			|ИЗ
			|	Справочник.ar_Диалоги КАК Диалоги
			|ГДЕ
			|	Диалоги.ar_Запуск = &RunId";
		Запрос.УстановитьПараметр("RunId", СокрЛП(RunId));

		Выборка = Запрос.Выполнить().Выбрать();
		НайденныйДиалог = ?(Выборка.Следующий(), Выборка.Диалог, ПустойДиалог);
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат НайденныйДиалог;

КонецФункции

// Создать диалог. Вызывается из транзакции вопроса (ar_Подтверждение) и из
// формы чата. Вызывающий код работает в привилегированном режиме (транзакция
// вопроса) либо от имени создавшего пользователя (чат).
//
// Параметры:
//  ПараметрыДиалога - Структура:
//   * Заголовок             - Строка - наименование элемента.
//   * Якорь                 - Строка - ar_Якорь (для чата, например "chat:<UUID>").
//   * Агент                 - СправочникСсылка.ar_Агенты.
//   * Провайдер             - СправочникСсылка.ar_LLMПровайдеры - для режима «без агента».
//   * БезАгента             - Булево.
//   * Инструменты           - Массив из Строка - ТЧ ar_ВыбранныеИнструменты (чат).
//   * ВидДиалога            - ПеречислениеСсылка.ar_ВидыДиалогов.
//   * Предмет               - ЛюбаяСсылка - предмет диалога (ссылка справочника или документа).
//   * ПредставлениеПредмета - Строка.
//   * Запуск                - Строка(36) - RunId.
//   * Инициатор             - СправочникСсылка.Пользователи.
//   * Состояние             - ПеречислениеСсылка.ar_СостоянияДиалогов (по умолчанию ВРаботе).
//   * ОткрытыйВопрос        - Строка(36) - идентификатор открытого вопроса (диалоги вопросов).
//   * ДатаВопроса           - Дата - момент вопроса.
//   * ОтветитьДо            - Дата - срок ответа.
//   * Участники             - Массив из Структура {Пользователь, Основание} - адрес почты
//                             читается из карточки пользователя и пишется в ar_АдресПочты.
//
// Возвращаемое значение:
//  СправочникСсылка.ar_Диалоги - созданный диалог.
//
Функция СоздатьДиалог(Знач ПараметрыДиалога) Экспорт

	Объект = Справочники.ar_Диалоги.СоздатьЭлемент();

	Объект.Наименование = Лев(ПараметрДиалога(ПараметрыДиалога, "Заголовок",
		НСтр("ru='Новый диалог'; en='New dialog'")), 150);
	Объект.ar_Якорь     = ПараметрДиалога(ПараметрыДиалога, "Якорь", "");
	Объект.ar_Агент     = ПараметрДиалога(ПараметрыДиалога, "Агент", Справочники.ar_Агенты.ПустаяСсылка());
	Объект.ar_Провайдер = ПараметрДиалога(ПараметрыДиалога, "Провайдер",
		Справочники.ar_LLMПровайдеры.ПустаяСсылка());
	Объект.ar_БезАгента = ПараметрДиалога(ПараметрыДиалога, "БезАгента", Ложь);
	Объект.ar_Создан    = ТекущаяДатаСеанса();
	Объект.ar_Обновлён  = ТекущаяДатаСеанса();

	Объект.ar_ВидДиалога            = ПараметрДиалога(ПараметрыДиалога, "ВидДиалога", Перечисления.ar_ВидыДиалогов.Чат);
	Объект.ar_Состояние             = ПараметрДиалога(ПараметрыДиалога, "Состояние", Перечисления.ar_СостоянияДиалогов.ВРаботе);
	Объект.ar_Предмет               = ПараметрДиалога(ПараметрыДиалога, "Предмет", Неопределено);
	Объект.ar_ПредставлениеПредмета = Лев(ПараметрДиалога(ПараметрыДиалога, "ПредставлениеПредмета", ""), 150);
	Объект.ar_Запуск                = Лев(ПараметрДиалога(ПараметрыДиалога, "Запуск", ""), 36);
	Объект.ar_Инициатор             = ПараметрДиалога(ПараметрыДиалога, "Инициатор", Неопределено);
	Объект.ar_ОткрытыйВопрос        = Лев(ПараметрДиалога(ПараметрыДиалога, "ОткрытыйВопрос", ""), 36);
	Объект.ar_ДатаВопроса           = ПараметрДиалога(ПараметрыДиалога, "ДатаВопроса", Дата('00010101'));
	Объект.ar_ОтветитьДо            = ПараметрДиалога(ПараметрыДиалога, "ОтветитьДо", Дата('00010101'));

	Инструменты = ПараметрДиалога(ПараметрыДиалога, "Инструменты", Неопределено);
	Если ТипЗнч(Инструменты) = Тип("Массив") Тогда
		Для Каждого Имя Из Инструменты Цикл
			СтрокаТЧ = Объект.ar_ВыбранныеИнструменты.Добавить();
			СтрокаТЧ.ar_Имя = Лев(СокрЛП(Строка(Имя)), 100);
		КонецЦикла;
	КонецЕсли;

	ЗаполнитьУчастниковДиалога(Объект, ПараметрДиалога(ПараметрыДиалога, "Участники", Неопределено));

	Объект.Записать();
	Возврат Объект.Ссылка;

КонецФункции

// Записать сообщение ленты от имени формы чата (перенесено из модуля формы
// ar_Диалог, спека п.5). Ключ - диалог.
//
// Параметры:
//  Диалог     - СправочникСсылка.ar_Диалоги - диалог.
//  Роль       - Строка - строковая роль чата (user/assistant/tool_result/ask_user/status).
//  Текст      - Строка - текст сообщения.
//  RunId      - Строка - идентификатор запуска.
//  ApprovalId - Строка - идентификатор подтверждения (вопроса).
//
Процедура ЗаписатьСообщениеЛенты(Знач Диалог, Знач Роль, Знач Текст,
		Знач RunId, Знач ApprovalId) Экспорт

	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ВидСообщения", ВидСообщенияПоРоли(Роль));
	ПараметрыЗаписи.Вставить("Текст", Текст);
	ПараметрыЗаписи.Вставить("RunId", RunId);
	ПараметрыЗаписи.Вставить("ИдентификаторВопроса", ApprovalId);

	ЗаписатьСообщениеДиалога(Диалог, ПараметрыЗаписи);

КонецПроцедуры

// Универсальная запись сообщения ленты (спека п.5-7). Выполняется в
// привилегированном режиме: вызывается из транзакций ядра и из форм.
//
// Параметры:
//  Диалог          - СправочникСсылка.ar_Диалоги - диалог.
//  ПараметрыЗаписи - Структура:
//   * ВидСообщения         - ПеречислениеСсылка.ar_ВидыСообщенийДиалога.
//   * Текст                - Строка.
//   * RunId                - Строка - ar_Запуск.
//   * ИдентификаторВопроса - Строка - ar_ИдентификаторВопроса.
//   * Автор                - СправочникСсылка.Пользователи.
//   * Подсказка            - Строка.
//   * ВариантыОтвета       - Строка - сериализованные варианты (как в payload).
//   * ВыбранИзВариантов    - Булево.
//   * ОжидаетОбработки     - Булево.
//
Процедура ЗаписатьСообщениеДиалога(Знач Диалог, Знач ПараметрыЗаписи) Экспорт

	Если Не ЗначениеЗаполнено(Диалог) Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Попытка

		НачатьТранзакцию();
		Попытка
			ЗаписатьСообщениеВТранзакции(Диалог, ПараметрыЗаписи);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;

	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Записать сообщение ленты ВНУТРИ уже открытой транзакции вызывающего кода
// (транзакция вопроса/ответа ar_Подтверждение). Блокировку ленты ставит сам;
// платформа реентерабельна по блокировке в пределах одной транзакции.
// Привилегированный режим НЕ переключает - поднят вызывающим.
//
// Параметры - см. ЗаписатьСообщениеДиалога.
//
Процедура ЗаписатьСообщениеВТранзакции(Знач Диалог, Знач ПараметрыЗаписи) Экспорт

	Если Не ЗначениеЗаполнено(Диалог) Тогда
		Возврат;
	КонецЕсли;

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_ЛентаДиалога");
	ЭлементБлокировки.УстановитьЗначение("ar_Диалог", Диалог);
	Блокировка.Заблокировать();

	МенеджерЗаписи = РегистрыСведений.ar_ЛентаДиалога.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ar_Диалог = Диалог;
	МенеджерЗаписи.ar_Номер  = СледующийНомерЛенты(Диалог);
	МенеджерЗаписи.ar_ВидСообщения = ПараметрЗаписи(ПараметрыЗаписи, "ВидСообщения",
		Перечисления.ar_ВидыСообщенийДиалога.Служебное);
	МенеджерЗаписи.ar_Текст  = ПараметрЗаписи(ПараметрыЗаписи, "Текст", "");
	МенеджерЗаписи.ar_Запуск = Лев(ПараметрЗаписи(ПараметрыЗаписи, "RunId", ""), 36);
	МенеджерЗаписи.ar_ИдентификаторВопроса = Лев(ПараметрЗаписи(ПараметрыЗаписи, "ИдентификаторВопроса", ""), 36);
	МенеджерЗаписи.ar_Момент = ТекущаяДатаСеанса();
	МенеджерЗаписи.ar_Автор  = ПараметрЗаписи(ПараметрыЗаписи, "Автор", Неопределено);
	МенеджерЗаписи.ar_Подсказка = Лев(ПараметрЗаписи(ПараметрыЗаписи, "Подсказка", ""), 500);
	МенеджерЗаписи.ar_ВариантыОтвета = ПараметрЗаписи(ПараметрыЗаписи, "ВариантыОтвета", "");
	МенеджерЗаписи.ar_ОтветВыбранИзВариантов = ПараметрЗаписи(ПараметрыЗаписи, "ВыбранИзВариантов", Ложь);
	МенеджерЗаписи.ar_ОжидаетОбработки = ПараметрЗаписи(ПараметрыЗаписи, "ОжидаетОбработки", Ложь);
	МенеджерЗаписи.Записать();

КонецПроцедуры

// Лента диалога (перенесено из модуля формы ar_Диалог, спека п.5). Работа в
// привилегированном режиме после проверки доступа (п.19).
//
// Параметры:
//  Диалог - СправочникСсылка.ar_Диалоги - диалог.
//
// Возвращаемое значение:
//  Массив из Структура - {ВидСообщения, Роль, Текст, Момент, Автор, Подсказка,
//  ВариантыОтвета, ИдентификаторВопроса, ОжидаетОбработки}, упорядочено по номеру;
//  Роль - строковая роль чата по виду сообщения.
//
Функция ЛентаДиалога(Знач Диалог) Экспорт

	Результат = Новый Массив;

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Результат = ЛентаДиалогаВнутр(Диалог);
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;

КонецФункции

// Чтение ленты (внутренняя): работает под уже поднятыми привилегиями.
//
Функция ЛентаДиалогаВнутр(Знач Диалог)

	Результат = Новый Массив;

	Если Не ДоступКДиалогуРазрешён(Диалог) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаЛенты();
	Запрос.УстановитьПараметр("Диалог", Диалог);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = Новый Структура;
		Запись.Вставить("ВидСообщения", Выборка.ВидСообщения);
		Запись.Вставить("Роль",   РольПоВидуСообщения(Выборка.ВидСообщения));
		Запись.Вставить("Текст",  Выборка.Текст);
		Запись.Вставить("Момент", Выборка.Момент);
		Запись.Вставить("Автор",  Выборка.Автор);
		Запись.Вставить("Подсказка", Выборка.Подсказка);
		Запись.Вставить("ВариантыОтвета", Выборка.ВариантыОтвета);
		Запись.Вставить("ИдентификаторВопроса", СокрЛП(Выборка.ИдентификаторВопроса));
		Запись.Вставить("ОжидаетОбработки", Выборка.ОжидаетОбработки);
		Результат.Добавить(Запись);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Текст последней записи ленты с заданной ролью (перенесено из формы ar_Диалог).
//
Функция ПоследнийТекстЛенты(Знач Диалог, Знач Роль) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Результат = ПоследнийТекстЛентыВнутр(Диалог, Роль);
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;

КонецФункции

// Текст последней записи (внутренняя): работает под уже поднятыми привилегиями.
//
Функция ПоследнийТекстЛентыВнутр(Знач Диалог, Знач Роль)

	Если Не ДоступКДиалогуРазрешён(Диалог) Тогда
		Возврат "";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Сообщения.ar_Текст КАК Текст
		|ИЗ
		|	РегистрСведений.ar_ЛентаДиалога КАК Сообщения
		|ГДЕ
		|	Сообщения.ar_Диалог = &Диалог
		|	И Сообщения.ar_ВидСообщения = &ВидСообщения
		|УПОРЯДОЧИТЬ ПО
		|	Сообщения.ar_Номер УБЫВ";
	Запрос.УстановитьПараметр("Диалог", Диалог);
	Запрос.УстановитьПараметр("ВидСообщения", ВидСообщенияПоРоли(Роль));

	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Текст, "");

КонецФункции

// Есть ли в ленте запись с заданными запуском и ролью (перенесено из формы
// ar_Диалог). ИдентификаторВопроса уточняет ключ до одного вопроса.
//
Функция ЕстьЗаписьЛенты(Знач Диалог, Знач RunId, Знач Роль,
	Знач ИдентификаторВопроса = "") Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Результат = ЕстьЗаписьЛентыВнутр(Диалог, RunId, Роль, ИдентификаторВопроса);
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;

КонецФункции

// Признак записи ленты (внутренняя): работает под уже поднятыми привилегиями.
//
Функция ЕстьЗаписьЛентыВнутр(Знач Диалог, Знач RunId, Знач Роль,
	Знач ИдентификаторВопроса)

	Если Не ДоступКДиалогуРазрешён(Диалог) Тогда
		Возврат Ложь;
	КонецЕсли;

	ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Сообщения.ar_Номер КАК Номер
		|ИЗ
		|	РегистрСведений.ar_ЛентаДиалога КАК Сообщения
		|ГДЕ
		|	Сообщения.ar_Диалог = &Диалог
		|	И Сообщения.ar_Запуск = &RunId
		|	И Сообщения.ar_ВидСообщения = &ВидСообщения";

	Если НЕ ПустаяСтрока(ИдентификаторВопроса) Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС
			+ "	И Сообщения.ar_ИдентификаторВопроса = &ИдентификаторВопроса";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Диалог", Диалог);
	Запрос.УстановитьПараметр("RunId", RunId);
	Запрос.УстановитьПараметр("ВидСообщения", ВидСообщенияПоРоли(Роль));
	Если НЕ ПустаяСтрока(ИдентификаторВопроса) Тогда
		Запрос.УстановитьПараметр("ИдентификаторВопроса", ИдентификаторВопроса);
	КонецЕсли;

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

// Удалить ленту диалога (очистка при удалении диалога из формы чата).
//
Процедура УдалитьЛентуДиалога(Знач Диалог) Экспорт

	Если Не ЗначениеЗаполнено(Диалог) Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		НачатьТранзакцию();
		Попытка

			НаборПоДиалогу = РегистрыСведений.ar_ЛентаДиалога.СоздатьНаборЗаписей();
			НаборПоДиалогу.Отбор.ar_Диалог.Установить(Диалог);
			НаборПоДиалогу.Записать();

			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Диалог перешёл в «Ожидает ответа» (спека п.6): состояние, открытый вопрос,
// дата вопроса, срок ответа. Вызывается из транзакции вопроса (ar_Подтверждение).
//
Процедура ДиалогОжидаетОтвета(Знач Диалог, Знач ИдентификаторВопроса,
	Знач ОтветитьДо) Экспорт

	ОбновитьДиалог(Диалог, Новый Структура(
		"Состояние, ОткрытыйВопрос, ДатаВопроса, ОтветитьДо",
		Перечисления.ar_СостоянияДиалогов.ОжидаетОтвета,
		Лев(СокрЛП(ИдентификаторВопроса), 36),
		ТекущаяДатаСеанса(),
		ОтветитьДо));

КонецПроцедуры

// Диалог вернулся в работу (ответ дан либо запуск по сообщению стартовал).
//
Процедура ДиалогВозобновлён(Знач Диалог) Экспорт

	ОбновитьДиалог(Диалог, Новый Структура(
		"Состояние, ОткрытыйВопрос",
		Перечисления.ar_СостоянияДиалогов.ВРаботе, ""));

КонецПроцедуры

// Диалог истёк по сроку ответа (вызывается из ar_Подтверждение.ИстечьВопрос).
//
Процедура ДиалогИстёк(Знач Диалог) Экспорт

	ОбновитьДиалог(Диалог, Новый Структура("Состояние",
		Перечисления.ar_СостоянияДиалогов.Истёк));

КонецПроцедуры

// Завершение запуска (спека п.8): вызывается из ar_RuntimeЦикл.ЗавершитьЗапуск.
// Диалог вида «Вопросы агента» с финальным статусом запуска получает итоговое
// сообщение агента (при ошибке - служебное с причиной) и состояние «Завершён».
//
// Параметры:
//  RunId            - Строка - идентификатор запуска.
//  ДанныеЗавершения - Структура - {Статус, ОтветLLM, ...} из ar_RuntimeЦикл.
//
Процедура ПриЗавершенииЗапуска(Знач RunId, Знач ДанныеЗавершения) Экспорт

	Если ТипЗнч(ДанныеЗавершения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Статус = Неопределено;
	Если Не ДанныеЗавершения.Свойство("Статус", Статус)
		Или Не ЗначениеЗаполнено(Статус) Тогда
		Возврат; // Переход в Выполняется и другие промежуточные - не завершение.
	КонецЕсли;

	Если Не ЭтоФинальныйСтатусЗапуска(Статус) Тогда
		Возврат;
	КонецЕсли;

	Диалог = ДиалогЗапуска(RunId);
	Если Не ЗначениеЗаполнено(Диалог) Тогда
		Возврат;
	КонецЕсли;

	Если ШапкаДиалога(Диалог).ВидДиалога <> Перечисления.ar_ВидыДиалогов.ВопросыАгента Тогда
		Возврат; // Чат завершает ленту сам (СинхронизироватьХвостДиалога).
	КонецЕсли;

	ИтоговыйТекст = "";
	ДанныеЗавершения.Свойство("ОтветLLM", ИтоговыйТекст);

	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("RunId", RunId);
	Если Статус = Перечисления.ar_СтатусЗапуска.Завершён Тогда
		ПараметрыЗаписи.Вставить("ВидСообщения",
			Перечисления.ar_ВидыСообщенийДиалога.СообщениеАгента);
		ПараметрыЗаписи.Вставить("Текст", ИтоговыйТекст);
	Иначе
		ПараметрыЗаписи.Вставить("ВидСообщения",
			Перечисления.ar_ВидыСообщенийДиалога.Служебное);
		ПараметрыЗаписи.Вставить("Текст", СтрШаблон(
			НСтр("ru='Запуск завершён со статусом «%1».';
				|en='Run finished with status «%1».'"),
			Строка(Статус)));
	КонецЕсли;

	ЗаписатьСообщениеДиалога(Диалог, ПараметрыЗаписи);

	ОбновитьДиалог(Диалог, Новый Структура("Состояние, ОткрытыйВопрос",
		Перечисления.ar_СостоянияДиалогов.Завершён, ""));

КонецПроцедуры

// Отправить сообщение человека в диалог из форм (спека п.13). Единая точка ввода.
//
//  * ОжидаетОтвета → ответ на открытый вопрос (ar_Подтверждение.ОтветитьНаВопрос);
//  * Завершён / Истёк (вид «Вопросы агента») → сообщение пользователя с признаком
//    «ожидает обработки» и попытка запуска агента (п.14);
//  * ВРаботе → отказ «агент работает, дождитесь ответа»;
//  * вид Чат → отказ (чат ведётся в консоли).
//
// Параметры:
//  Диалог - СправочникСсылка.ar_Диалоги - диалог.
//  Текст  - Строка - текст сообщения.
//
// Возвращаемое значение:
//  Структура - {Успех: Булево, Сообщение: Строка - текст для пользователя}.
//
Функция ОтправитьСообщение(Знач Диалог, Знач Текст) Экспорт

	Результат = Новый Структура("Успех, Сообщение", Ложь, "");

	Если ТипЗнч(Текст) <> Тип("Строка") Или ПустаяСтрока(СокрЛП(Текст)) Тогда
		Результат.Сообщение = НСтр("ru='Введите текст сообщения.'; en='Enter the message text.'");
		Возврат Результат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Результат = ОтправитьСообщениеВнутр(Диалог, Текст);
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;

КонецФункции

// Отправка сообщения (внутренняя): работает под уже поднятыми привилегиями.
//
Функция ОтправитьСообщениеВнутр(Знач Диалог, Знач Текст)

	Результат = Новый Структура("Успех, Сообщение", Ложь, "");

	Если Не ДоступКДиалогуРазрешён(Диалог) Тогда
		Результат.Сообщение = НСтр("ru='Недостаточно прав для этого диалога.';
			|en='Insufficient rights for this dialog.'");
		Возврат Результат;
	КонецЕсли;

	Шапка = ШапкаДиалога(Диалог);

	Если Шапка.ВидДиалога = Перечисления.ar_ВидыДиалогов.Чат Тогда
		Результат.Сообщение = НСтр("ru='Чат ведётся в консоли агентов.';
			|en='The chat is handled in the agent console.'");
		Возврат Результат;
	КонецЕсли;

	Если Шапка.Состояние = Перечисления.ar_СостоянияДиалогов.ВРаботе Тогда
		Результат.Сообщение = НСтр("ru='Агент работает, дождитесь ответа.';
			|en='The agent is working, please wait for the reply.'");
		Возврат Результат;
	КонецЕсли;

	Если Шапка.Состояние = Перечисления.ar_СостоянияДиалогов.ОжидаетОтвета
		И Не ПустаяСтрока(Шапка.ОткрытыйВопрос) Тогда

		Пользователь = ПараметрыСеанса.ТекущийПользователь;
		// Сообщение «Ответ» в ленту и переход диалога «В работе» выполняет сама
		// транзакция ответа (ar_Подтверждение.ОтветитьНаВопросБезПривилегий).
		Если ar_AuditЗащищённыйРежим.ОтветитьНаВопросПривилегированно(
			Шапка.ОткрытыйВопрос, Пользователь, Текст) Тогда

			Результат.Успех = Истина;
			Возврат Результат;
		КонецЕсли;

		Результат.Сообщение = НСтр("ru='Срок ответа истёк.';
			|en='The answer deadline has expired.'");
		Возврат Результат;
	КонецЕсли;

	// Завершён / Истёк: сообщение человека запускает агента (п.13-14).
	Если Шапка.Состояние = Перечисления.ar_СостоянияДиалогов.Завершён
		Или Шапка.Состояние = Перечисления.ar_СостоянияДиалогов.Истёк Тогда

		Пользователь = ПараметрыСеанса.ТекущийПользователь;

		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("ВидСообщения",
			Перечисления.ar_ВидыСообщенийДиалога.СообщениеПользователя);
		ПараметрыЗаписи.Вставить("Текст", ar_Утилиты.МаскироватьСекреты(Текст));
		ПараметрыЗаписи.Вставить("Автор", Пользователь);
		ПараметрыЗаписи.Вставить("ОжидаетОбработки", Истина);
		ЗаписатьСообщениеДиалога(Диалог, ПараметрыЗаписи);

		ИтогЗапуска = ЗапуститьАгентаПоСообщению(Диалог, Пользователь, Текст);
		Если ИтогЗапуска.Успех Тогда
			Результат.Успех = Истина;
		Иначе
			Результат.Сообщение = НСтр("ru='Агент занят, сообщение будет обработано.';
				|en='The agent is busy; the message will be processed later.'");
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Запустить агента по сообщению человека (спека п.14). Признак «ожидает
// обработки» снимается при успехе; при отказе признак остаётся (сообщение
// обработает тик планировщика). У агента с выключенными сессиями перед текстом
// добавляется блок «Предыдущая переписка» (не более 20 сообщений и 8000 знаков).
//
// Параметры:
//  Диалог - СправочникСсылка.ar_Диалоги.
//  Автор  - СправочникСсылка.Пользователи - автор сообщения.
//  Текст  - Строка - текст сообщения.
//
// Возвращаемое значение:
//  Структура - {Успех: Булево, Причина: Строка}.
//
Функция ЗапуститьАгентаПоСообщению(Знач Диалог, Знач Автор, Знач Текст) Экспорт

	Результат = Новый Структура("Успех, Причина", Ложь, "");
	Шапка = ШапкаДиалога(Диалог);

	Если Не ЗначениеЗаполнено(Шапка.Агент) Тогда
		СнятьОжиданиеСлужебнымСообщение(Диалог,
			НСтр("ru='У диалога нет агента, сообщение не отправлено.';
				|en='The dialog has no agent; the message was not sent.'"));
		Результат.Причина = "agent_not_found_or_inactive";
		Возврат Результат;
	КонецЕсли;

	ЗапросПользователя = Текст;
	Если Не ar_AuditЗащищённыйРежим.ИспользованиеСессийПривилегированно(Шапка.Агент) Тогда
		ЗапросПользователя = БлокПереписки(Диалог) + Текст;
	КонецЕсли;

	КонтекстТриггера = Новый Структура;
	КонтекстТриггера.Вставить("Триггер", "dialog_message");
	КонтекстТриггера.Вставить("ЯкорьСсылка", Шапка.Предмет);
	КонтекстТриггера.Вставить("Диалог", Диалог);
	КонтекстТриггера.Вставить("ЗапросПользователя", ЗапросПользователя);
	КонтекстТриггера.Вставить("ПользовательРеф", Автор);

	ИтогСтарта = ar_RuntimeЗапуск.СтартоватьВФоне(Шапка.Агент, КонтекстТриггера);

	Если ИтогСтарта.Успех Тогда
		СнятьОжиданиеОбработки(Диалог);
		ДиалогВозобновлён(Диалог);
		ОбновитьДиалог(Диалог, Новый Структура("ПоследнийЗапуск",
			ИтогСтарта.RunId));
		Результат.Успех = Истина;
	Иначе
		Результат.Причина = ИтогСтарта.Причина;
		Если Результат.Причина = "agent_not_found_or_inactive" Тогда
			СнятьОжиданиеСлужебнымСообщение(Диалог,
				НСтр("ru='Агент выключен или удалён, сообщение не будет обработано.';
					|en='The agent is disabled or deleted; the message will not be processed.'"));
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Повтор тиком (спека п.15): сообщения с признаком «ожидает обработки»
// по порядку поступления, первые 50. Вызывается из ar_Планировщик.
//
Процедура ОбработатьНеобработанныеСообщения() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 50
			|	Сообщения.ar_Диалог КАК Диалог,
			|	Сообщения.ar_Текст КАК Текст,
			|	Сообщения.ar_Автор КАК Автор
			|ИЗ
			|	РегистрСведений.ar_ЛентаДиалога КАК Сообщения
			|ГДЕ
			|	Сообщения.ar_ОжидаетОбработки = ИСТИНА
			|	И Сообщения.ar_ВидСообщения = &ВидСообщения
			|УПОРЯДОЧИТЬ ПО
			|	Сообщения.ar_Момент";
		Запрос.УстановитьПараметр("ВидСообщения",
			Перечисления.ar_ВидыСообщенийДиалога.СообщениеПользователя);

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			// Гонка с формой безопасна: ЗапуститьАгентаПоСообщению снимает признак
			// только при успехе, а повторный запуск того же сообщения при активном
			// агенте вернёт agent_already_running и признак останется.
			Попытка
				ЗапуститьАгентаПоСообщению(Выборка.Диалог, Выборка.Автор, Выборка.Текст);
			Исключение
				ЗаписатьОшибкуЖурнал(СтрШаблон(
					НСтр("ru='Диалоги: не удалось обработать сообщение диалога %1: %2';
						|en='Dialogs: failed to process a message of dialog %1: %2'"),
					Строка(Выборка.Диалог),
					ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
			КонецПопытки;
		КонецЦикла;
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Участники диалога по правилу адресата (спека п.9). Участники определяются
// один раз - при создании диалога.
//
// Параметры:
//  ПравилоАдресата      - Строка - "agent_owner" (по умолчанию) | "subject_attribute" | "initiator".
//  ИмяРеквизитаПредмета - Строка - имя реквизита предмета для "subject_attribute".
//  Агент                - СправочникСсылка.ar_Агенты.
//  Предмет              - ЛюбаяСсылка - предмет диалога (может быть пустой).
//  Инициатор            - СправочникСсылка.Пользователи - пользователь запуска.
//  Профиль              - СправочникСсылка.ar_ПрофилиЗапуска - профиль запуска.
//  ЗаменаАдресата       - Булево, начальное Ложь - Истина, если вызывающий уже
//                         зафиксировал подмену (сообщение в ленту не дублируется).
//
// Возвращаемое значение:
//  Структура - {Участники: Массив из Структура {Пользователь, Основание},
//               Подмена: Булево - правило не удалось применить буквально}.
//
Функция УчастникиПоПравилу(Знач ПравилоАдресата, Знач ИмяРеквизитаПредмета,
	Знач Агент, Знач Предмет, Знач Инициатор, Знач Профиль, Знач ЗаменаАдресата = Ложь) Экспорт

	Участники = Новый Массив;
	Подмена = ЗаменаАдресата;

	// Незнакомое правило - как agent_owner (спека п.9: agent_owner по умолчанию).
	Если ПравилоАдресата <> "initiator" И ПравилоАдресата <> "subject_attribute" Тогда
		ПравилоАдресата = "agent_owner";
	КонецЕсли;

	ОтветственныйЗаАгента = ПользовательАгента(Агент);

	Если ПравилоАдресата = "agent_owner" Тогда

		Если Не ЗначениеЗаполнено(ОтветственныйЗаАгента) Тогда
			// Пусто - ответственные профиля запуска, никого - администраторы.
			ДобавитьОтветственныхПрофиля(Участники, Профиль);
			Если Участники.Количество() = 0 Тогда
				ДобавитьАдминистраторов(Участники);
				Подмена = Истина;
			КонецЕсли;
		Иначе
			ДобавитьБезДублей(Участники, Участник(ОтветственныйЗаАгента,
				Перечисления.ar_ОснованияУчастияВДиалоге.ОтветственныйЗаАгента));
		КонецЕсли;

		Возврат ИтогПравилаУчастников(Участники, Подмена);

	ИначеЕсли ПравилоАдресата = "initiator" Тогда

		Если ЗначениеЗаполнено(Инициатор) Тогда
			Участники.Добавить(Участник(Инициатор,
				Перечисления.ar_ОснованияУчастияВДиалоге.Инициатор));
		Иначе
			Подмена = Истина; // Пользователя запуска нет - адресат подменён.
		КонецЕсли;
		ДобавитьБезДублей(Участники, Участник(ОтветственныйЗаАгента,
			Перечисления.ar_ОснованияУчастияВДиалоге.ОтветственныйЗаАгента));
		Если Участники.Количество() = 0 Тогда
			ДобавитьОтветственныхПрофиля(Участники, Профиль);
			Подмена = Истина;
		КонецЕсли;

		Возврат ИтогПравилаУчастников(Участники, Подмена);

	КонецЕсли;

	// subject_attribute: пользователь из реквизита предмета + ответственный за агента.
	ПользовательИзРеквизита = ПользовательИзРеквизитаПредмета(Предмет, ИмяРеквизитаПредмета);
	Если ЗначениеЗаполнено(ПользовательИзРеквизита) Тогда
		Участники.Добавить(Участник(ПользовательИзРеквизита,
			Перечисления.ar_ОснованияУчастияВДиалоге.РеквизитПредмета));
	Иначе
		Подмена = Истина; // Предмета нет, реквизит не найден, пуст или не пользователь.
	КонецЕсли;
	ДобавитьБезДублей(Участники, Участник(ОтветственныйЗаАгента,
		Перечисления.ar_ОснованияУчастияВДиалоге.ОтветственныйЗаАгента));
	Если Участники.Количество() = 0 Тогда
		ДобавитьОтветственныхПрофиля(Участники, Профиль);
		Подмена = Истина;
	КонецЕсли;

	Возврат ИтогПравилаУчастников(Участники, Подмена);

КонецФункции

// Итог правила адресата - единая структура результата.
//
Функция ИтогПравилаУчастников(Знач Участники, Знач Подмена)

	Возврат Новый Структура("Участники, Подмена", Участники, Подмена);

КонецФункции

// Пользователь из реквизита предмета (спека п.9): имя проверяется по метаданным
// предмета (реквизит или стандартный реквизит), значение - заполненная ссылка
// на Справочник.Пользователи.
//
Функция ПользовательИзРеквизитаПредмета(Знач Предмет, Знач ИмяРеквизита) Экспорт

	Если Не ЗначениеЗаполнено(Предмет)
		Или ТипЗнч(ИмяРеквизита) <> Тип("Строка")
		Или ПустаяСтрока(СокрЛП(ИмяРеквизита)) Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;

	МетаданныеПредмета = МетаданныеПоСсылке(Предмет);
	Если МетаданныеПредмета = Неопределено Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;

	Если МетаданныеПредмета.Реквизиты.Найти(СокрЛП(ИмяРеквизита)) = Неопределено
		И МетаданныеПредмета.СтандартныеРеквизиты.Найти(СокрЛП(ИмяРеквизита)) = Неопределено Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;

	ЗначениеРеквизита = Неопределено;
	Попытка
		ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Предмет, СокрЛП(ИмяРеквизита));
	Исключение
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецПопытки;

	Если ТипЗнч(ЗначениеРеквизита) = Тип("СправочникСсылка.Пользователи")
		И ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		Возврат ЗначениеРеквизита;
	КонецЕсли;

	Возврат Справочники.Пользователи.ПустаяСсылка();

КонецФункции

// Проверка доступа к диалогу (спека п.19): участник либо оператор /
// администратор / полные права; для чата консоли - также инициатор и читатель.
//
Функция ЕстьДоступКДиалогу(Знач Диалог) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Возврат ДоступКДиалогуРазрешён(Диалог);
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

КонецФункции

// Шапка диалога одним чтением (для форм и ядра).
//
// Возвращаемое значение:
//  Структура - {ВидДиалога, Состояние, ОткрытыйВопрос, ОтветитьДо, Агент,
//               Предмет, ПредставлениеПредмета, Инициатор, ПоследнийЗапуск, Якорь}.
//
Функция ШапкаДиалога(Знач Диалог) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ВидДиалога", Перечисления.ar_ВидыДиалогов.Чат);
	Результат.Вставить("Состояние", Перечисления.ar_СостоянияДиалогов.Завершён);
	Результат.Вставить("ОткрытыйВопрос", "");
	Результат.Вставить("ОтветитьДо", Дата('00010101'));
	Результат.Вставить("Агент", Справочники.ar_Агенты.ПустаяСсылка());
	Результат.Вставить("Предмет", Неопределено);
	Результат.Вставить("ПредставлениеПредмета", "");
	Результат.Вставить("Инициатор", Справочники.Пользователи.ПустаяСсылка());
	Результат.Вставить("ПоследнийЗапуск", "");
	Результат.Вставить("Якорь", "");

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Если ЗначениеЗаполнено(Диалог) И ОбщегоНазначения.СсылкаСуществует(Диалог) Тогда
			ЗаполнитьШапкуДиалога(Результат, Диалог);
		КонецЕсли;
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;

КонецФункции

// Заполнить структуру шапки (внутренняя): под уже поднятыми привилегиями.
//
Процедура ЗаполнитьШапкуДиалога(Результат, Знач Диалог)

	Значения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Диалог,
		"ar_ВидДиалога, ar_Состояние, ar_ОткрытыйВопрос, ar_ОтветитьДо, ar_Агент,
		|ar_Предмет, ar_ПредставлениеПредмета, ar_Инициатор, ar_ПоследнийЗапуск, ar_Якорь");

	Результат.ВидДиалога           = Значения.ar_ВидДиалога;
	Результат.Состояние            = Значения.ar_Состояние;
	Результат.ОткрытыйВопрос        = СокрЛП(Значения.ar_ОткрытыйВопрос);
	Результат.ОтветитьДо            = Значения.ar_ОтветитьДо;
	Результат.Агент                 = Значения.ar_Агент;
	Результат.Предмет               = Значения.ar_Предмет;
	Результат.ПредставлениеПредмета = Значения.ar_ПредставлениеПредмета;
	Результат.Инициатор             = Значения.ar_Инициатор;
	Результат.ПоследнийЗапуск       = СокрЛП(Значения.ar_ПоследнийЗапуск);
	Результат.Якорь                 = СокрЛП(Значения.ar_Якорь);

КонецПроцедуры

// Разметка ленты диалога в HTML для форм справочника ar_Диалоги (спека п.16).
// Текст экранируется - разметка строится только ядром.
//
// Параметры:
//  Диалог - СправочникСсылка.ar_Диалоги.
//
// Возвращаемое значение:
//  Строка - HTML-разметка ленты; пустая строка, если доступа нет.
//
Функция РазметкаЛентыHTML(Знач Диалог) Экспорт

	Записи = ЛентаДиалога(Диалог);
	Если Записи.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;

	Кавычка = Символ(34);
	СтрокиHTML = Новый Массив;
	СтрокиHTML.Добавить("<!DOCTYPE html><html><head><meta charset=""utf-8"" />"
		+ "<style>"
		+ "body{font-family:Verdana,Arial,sans-serif;font-size:12px;margin:8px;}"
		+ ".msg{border:1px solid #d8d8d8;border-radius:6px;padding:6px 8px;margin-bottom:8px;}"
		+ ".head{color:#666;font-size:10px;margin-bottom:3px;}"
		+ ".question{background:#fff7e0;}"
		+ ".answer{background:#eef7ee;}"
		+ ".service{background:#f2f2f2;color:#555;}"
		+ ".hint{color:#777;font-style:italic;}"
		+ "</style></head><body>");

	Для Каждого Запись Из Записи Цикл
		Класс = КлассСообщения(Запись.ВидСообщения);
		Автор = ?(ЗначениеЗаполнено(Запись.Автор), Строка(Запись.Автор),
			НаименованиеВида(Запись.ВидСообщения));
		СтрокиHTML.Добавить("<div class=" + Кавычка + "msg " + Класс + Кавычка + ">");
		СтрокиHTML.Добавить("<div class=" + Кавычка + "head" + Кавычка + ">" + ЭкранироватьHTML(Автор) + ", "
			+ Формат(Запись.Момент, "ДФ='dd.MM.yyyy HH:mm:ss'") + "</div>");
		ТекстСообщения = ЭкранироватьHTML(Запись.Текст);
		СтрокиHTML.Добавить("<div>" + СтрЗаменить(ТекстСообщения, Символы.ПС, "<br />") + "</div>");
		Если Не ПустаяСтрока(Запись.Подсказка) Тогда
			СтрокиHTML.Добавить("<div class=" + Кавычка + "hint" + Кавычка + ">" + ЭкранироватьHTML(Запись.Подсказка) + "</div>");
		КонецЕсли;
		Если Запись.ОжидаетОбработки Тогда
			СтрокиHTML.Добавить("<div class=" + Кавычка + "hint" + Кавычка + ">" + ЭкранироватьHTML(
				НСтр("ru='Ожидает обработки'; en='Awaiting processing'")) + "</div>");
		КонецЕсли;
		СтрокиHTML.Добавить("</div>");
	КонецЦикла;

	СтрокиHTML.Добавить("</body></html>");
	Возврат СтрСоединить(СтрокиHTML, Символы.ПС);

КонецФункции

// Варианты ответа открытого вопроса диалога (спека п.16): из последнего сообщения
// «Вопрос» ленты (ресурс ar_ВариантыОтвета, JSON). Привилегированно, после
// проверки доступа (п.19) - формы регистр ленты напрямую не читают.
//
// Параметры:
//  Диалог - СправочникСсылка.ar_Диалоги.
//
// Возвращаемое значение:
//  Массив из Строка - варианты ответа; пустой массив, если вариантов или доступа нет.
//
Функция ВариантыОткрытогоВопроса(Знач Диалог) Экспорт

	Варианты = Новый Массив;

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Если ДоступКДиалогуРазрешён(Диалог) Тогда
			ЗаполнитьВариантыОткрытогоВопроса(Варианты, Диалог);
		КонецЕсли;
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Варианты;

КонецФункции

// Служебное сообщение о подмене адресата в ленту диалога (спека п.9).
//
Процедура ЗаписатьПодменуАдресата(Знач Диалог, Знач ОписаниеПодмены) Экспорт

	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ВидСообщения", Перечисления.ar_ВидыСообщенийДиалога.Служебное);
	ПараметрыЗаписи.Вставить("Текст", СтрШаблон(
		НСтр("ru='Адресат вопроса изменён: %1';
			|en='The question recipient was changed: %1'"),
		ОписаниеПодмены));
	ЗаписатьСообщениеДиалога(Диалог, ПараметрыЗаписи);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Текст запроса ленты с составом колонок.
//
Функция ТекстЗапросаЛенты()

	Возврат
		"ВЫБРАТЬ
		|	Сообщения.ar_ВидСообщения КАК ВидСообщения,
		|	Сообщения.ar_Текст КАК Текст,
		|	Сообщения.ar_Момент КАК Момент,
		|	Сообщения.ar_Автор КАК Автор,
		|	Сообщения.ar_Подсказка КАК Подсказка,
		|	Сообщения.ar_ВариантыОтвета КАК ВариантыОтвета,
		|	Сообщения.ar_ИдентификаторВопроса КАК ИдентификаторВопроса,
		|	Сообщения.ar_ОжидаетОбработки КАК ОжидаетОбработки
		|ИЗ
		|	РегистрСведений.ar_ЛентаДиалога КАК Сообщения
		|ГДЕ
		|	Сообщения.ar_Диалог = &Диалог
		|УПОРЯДОЧИТЬ ПО
		|	Сообщения.ar_Номер ВОЗР";

КонецФункции

// Заполнить варианты ответа из последнего сообщения «Вопрос» (внутренняя):
// работает под уже поднятыми привилегиями.
//
Процедура ЗаполнитьВариантыОткрытогоВопроса(Варианты, Знач Диалог)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Сообщения.ar_ВариантыОтвета КАК ВариантыОтвета
		|ИЗ
		|	РегистрСведений.ar_ЛентаДиалога КАК Сообщения
		|ГДЕ
		|	Сообщения.ar_Диалог = &Диалог
		|	И Сообщения.ar_ВидСообщения = &ВидСообщения
		|УПОРЯДОЧИТЬ ПО
		|	Сообщения.ar_Номер УБЫВ";
	Запрос.УстановитьПараметр("Диалог", Диалог);
	Запрос.УстановитьПараметр("ВидСообщения", Перечисления.ar_ВидыСообщенийДиалога.Вопрос);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Или ПустаяСтрока(Выборка.ВариантыОтвета) Тогда
		Возврат;
	КонецЕсли;

	Разобранные = Неопределено;
	Попытка
		Разобранные = ar_JSON.ИзJSON(Выборка.ВариантыОтвета);
	Исключение
		Возврат;
	КонецПопытки;

	Если ТипЗнч(Разобранные) = Тип("Массив") Тогда
		Для Каждого Вариант Из Разобранные Цикл
			Если ТипЗнч(Вариант) = Тип("Строка") И Не ПустаяСтрока(Вариант) Тогда
				Варианты.Добавить(Вариант);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Следующий номер записи ленты диалога (максимум + 1; блокировка наложена
// вызывающим кодом).
//
Функция СледующийНомерЛенты(Знач Диалог)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(Сообщения.ar_Номер), 0) КАК МаксНомер
		|ИЗ
		|	РегистрСведений.ar_ЛентаДиалога КАК Сообщения
		|ГДЕ
		|	Сообщения.ar_Диалог = &Диалог";
	Запрос.УстановитьПараметр("Диалог", Диалог);

	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.МаксНомер + 1, 1);

КонецФункции

// Проверка доступа (вызывается из привилегированного контекста ядра):
// оператор / администратор / полные права; участник диалога; для чата консоли
// (вид «Чат» или пустой) - ещё инициатор и читатель.
//
Функция ДоступКДиалогуРазрешён(Знач Диалог)

	Если Не ЗначениеЗаполнено(Диалог) Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ЕстьРольРасширения() Тогда
		Возврат Истина;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Диалоги.ar_ВидДиалога КАК ВидДиалога,
		|	Диалоги.ar_Инициатор КАК Инициатор
		|ИЗ
		|	Справочник.ar_Диалоги КАК Диалоги
		|ГДЕ
		|	Диалоги.Ссылка = &Диалог";
	Запрос.УстановитьПараметр("Диалог", Диалог);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;

	Пользователь = ПараметрыСеанса.ТекущийПользователь;

	Если Выборка.ВидДиалога <> Перечисления.ar_ВидыДиалогов.ВопросыАгента Тогда
		Если ЗначениеЗаполнено(Пользователь) И Выборка.Инициатор = Пользователь Тогда
			Возврат Истина;
		КонецЕсли;
		Если РольДоступна("ar_РольЧитатель") Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;

	ЗапросУчастника = Новый Запрос;
	ЗапросУчастника.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Есть
		|ИЗ
		|	Справочник.ar_Диалоги.ar_Участники КАК Участники
		|ГДЕ
		|	Участники.Ссылка = &Диалог
		|	И Участники.ar_Пользователь = &Пользователь";
	ЗапросУчастника.УстановитьПараметр("Диалог", Диалог);
	ЗапросУчастника.УстановитьПараметр("Пользователь", Пользователь);

	Возврат НЕ ЗапросУчастника.Выполнить().Пустой();

КонецФункции

// Роль ar_РольОператор / ar_РольАдмин / ПолныеПрава у текущего пользователя.
//
Функция ЕстьРольРасширения()

	Возврат РольДоступна("ar_РольОператор")
		Или РольДоступна("ar_РольАдмин")
		Или РольДоступна("ПолныеПрава");

КонецФункции

// Обновить реквизиты диалога объектом (поля из СтруктурыЗначений).
//
Процедура ОбновитьДиалог(Знач Диалог, Знач СтруктурыЗначений)

	Если Не ЗначениеЗаполнено(Диалог) Или ТипЗнч(СтруктурыЗначений) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ОбъектДиалога = Диалог.ПолучитьОбъект();

		Если ОбъектДиалога <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ОбъектДиалога, СтруктурыЗначений);
			ОбъектДиалога.ar_Обновлён = ТекущаяДатаСеанса();
			ОбъектДиалога.Записать();
		КонецЕсли;
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Финальный статус запуска (единый список ar_ИнструментыВзаимодействие.ЗапускВФинальномСтатусе).
//
Функция ЭтоФинальныйСтатусЗапуска(Знач Статус)

	Возврат Статус = Перечисления.ar_СтатусЗапуска.Завершён
		Или Статус = Перечисления.ar_СтатусЗапуска.ОшибкаВыполнения
		Или Статус = Перечисления.ar_СтатусЗапуска.Отменён
		Или Статус = Перечисления.ar_СтатусЗапуска.ДостигнутМаксимумШагов
		Или Статус = Перечисления.ar_СтатусЗапуска.ОтклонёнГлобально
		Или Статус = Перечисления.ar_СтатусЗапуска.Прерван
		Или Статус = Перечисления.ar_СтатусЗапуска.ОшибкаНесовместимоеСостояние;

КонецФункции

// Заполнить ТЧ ar_Участники из массива структур {Пользователь, Основание};
// адрес почты читается из карточки пользователя (ar_Уведомления.EmailПользователя).
//
Процедура ЗаполнитьУчастниковДиалога(ОбъектДиалога, Участники)

	Если ТипЗнч(Участники) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	ДобавленныеПользователи = Новый Соответствие;

	Для Каждого ОписаниеУчастника Из Участники Цикл

		Пользователь = Неопределено;
		Если ТипЗнч(ОписаниеУчастника) = Тип("Структура") Тогда
			ОписаниеУчастника.Свойство("Пользователь", Пользователь);
		Иначе
			Пользователь = ОписаниеУчастника;
		КонецЕсли;

		Если ТипЗнч(Пользователь) <> Тип("СправочникСсылка.Пользователи")
			Или Не ЗначениеЗаполнено(Пользователь) Тогда
			Продолжить;
		КонецЕсли;

		Если ДобавленныеПользователи[Пользователь] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДобавленныеПользователи.Вставить(Пользователь, Истина);

		СтрокаТЧ = ОбъектДиалога.ar_Участники.Добавить();
		СтрокаТЧ.ar_Пользователь = Пользователь;
		Если ТипЗнч(ОписаниеУчастника) = Тип("Структура") Тогда
			СтрокаТЧ.ar_Основание = ОписаниеУчастника.Основание;
		КонецЕсли;
		СтрокаТЧ.ar_АдресПочты = Лев(ar_Уведомления.EmailПользователя(Пользователь), 150);

	КонецЦикла;

КонецПроцедуры

// Снять признак «ожидает обработки» у всех сообщений диалога (после успешного
// запуска агента).
//
Процедура СнятьОжиданиеОбработки(Знач Диалог)

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Сообщения.ar_Диалог КАК ar_Диалог,
			|	Сообщения.ar_Номер КАК ar_Номер
			|ИЗ
			|	РегистрСведений.ar_ЛентаДиалога КАК Сообщения
			|ГДЕ
			|	Сообщения.ar_Диалог = &Диалог
			|	И Сообщения.ar_ОжидаетОбработки = ИСТИНА";
		Запрос.УстановитьПараметр("Диалог", Диалог);

		ТаблицаЗаписей = Запрос.Выполнить().Выгрузить();

		НачатьТранзакцию();
		Попытка
			Для Каждого СтрокаЗаписи Из ТаблицаЗаписей Цикл
				МенеджерЗаписи = РегистрыСведений.ar_ЛентаДиалога.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаЗаписи);
				МенеджерЗаписи.Прочитать();
				Если МенеджерЗаписи.Выбран() Тогда
					МенеджерЗаписи.ar_ОжидаетОбработки = Ложь;
					МенеджерЗаписи.Записать();
				КонецЕсли;
			КонецЦикла;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Снять признак «ожидает обработки» и записать служебное сообщение с причиной
// (агент выключен/удалён - спека п.15).
//
Процедура СнятьОжиданиеСлужебнымСообщение(Знач Диалог, Знач ТекстСообщения)

	СнятьОжиданиеОбработки(Диалог);

	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ВидСообщения", Перечисления.ar_ВидыСообщенийДиалога.Служебное);
	ПараметрыЗаписи.Вставить("Текст", ТекстСообщения);
	ЗаписатьСообщениеДиалога(Диалог, ПараметрыЗаписи);

КонецПроцедуры

// Блок «Предыдущая переписка» для агентов с выключенными сессиями (спека п.14):
// последние сообщения ленты диалога, не более 20 сообщений и 8000 знаков.
//
Функция БлокПереписки(Знач Диалог)

	ЛимитСообщений = 20;
	ЛимитЗнаков    = 8000;

	Строки = Новый Массив;

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(МАКСИМУМ(Сообщения.ar_Номер), 0) КАК МаксНомер
			|ИЗ
			|	РегистрСведений.ar_ЛентаДиалога КАК Сообщения
			|ГДЕ
			|	Сообщения.ar_Диалог = &Диалог";
		Запрос.УстановитьПараметр("Диалог", Диалог);
		Выборка = Запрос.Выполнить().Выбрать();
		МаксНомер = 0;
		Если Выборка.Следующий() Тогда
			МаксНомер = Выборка.МаксНомер;
		КонецЕсли;

		ЗапросХвоста = Новый Запрос;
		ЗапросХвоста.Текст =
			"ВЫБРАТЬ
			|	Сообщения.ar_ВидСообщения КАК ВидСообщения,
			|	Сообщения.ar_Текст КАК Текст
			|ИЗ
			|	РегистрСведений.ar_ЛентаДиалога КАК Сообщения
			|ГДЕ
			|	Сообщения.ar_Диалог = &Диалог
			|	И Сообщения.ar_Номер > &МаксНомер - &ЛимитСообщений
			|	И Сообщения.ar_ВидСообщения <> &ВидСлужебное
			|УПОРЯДОЧИТЬ ПО
			|	Сообщения.ar_Номер ВОЗР";
		ЗапросХвоста.УстановитьПараметр("Диалог", Диалог);
		ЗапросХвоста.УстановитьПараметр("МаксНомер", МаксНомер);
		ЗапросХвоста.УстановитьПараметр("ЛимитСообщений", ЛимитСообщений);
		ЗапросХвоста.УстановитьПараметр("ВидСлужебное",
			Перечисления.ar_ВидыСообщенийДиалога.Служебное);

		ВыборкаХвоста = ЗапросХвоста.Выполнить().Выбрать();
		Пока ВыборкаХвоста.Следующий() Цикл
			Если Строки.Количество() >= ЛимитСообщений Тогда
				Прервать;
			КонецЕсли;
			ТекстСообщения = СокрЛП(ВыборкаХвоста.Текст);
			Если ПустаяСтрока(ТекстСообщения) Тогда
				Продолжить;
			КонецЕсли;
			Строки.Добавить(СтрШаблон("%1: %2",
				НаименованиеВида(ВыборкаХвоста.ВидСообщения), ТекстСообщения));
		КонецЦикла;
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

	Если Строки.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;

	Возврат СтрШаблон(НСтр("ru='Предыдущая переписка по диалогу:%1%2%1';
		|en='Previous dialog conversation:%1%2%1'"), Символы.ПС,
		Лев(СтрСоединить(Строки, Символы.ПС), ЛимитЗнаков)) + Символы.ПС;

КонецФункции

// Пользователь агента (ar_Агенты.ar_Пользователь); пустая ссылка, если не заполнен.
//
Функция ПользовательАгента(Знач Агент)

	Если Не ЗначениеЗаполнено(Агент) Или Не ОбщегоНазначения.СсылкаСуществует(Агент) Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;

	Пользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Агент, "ar_Пользователь");
	Возврат ?(ТипЗнч(Пользователь) = Тип("СправочникСсылка.Пользователи"),
		Пользователь, Справочники.Пользователи.ПустаяСсылка());

КонецФункции

// Участник диалога.
//
Функция Участник(Знач Пользователь, Знач Основание)

	Возврат Новый Структура("Пользователь, Основание", Пользователь, Основание);

КонецФункции

// Добавить участника, если такого пользователя ещё нет.
//
Процедура ДобавитьБезДублей(Участники, НовыйУчастник)

	Если Не ЗначениеЗаполнено(НовыйУчастник.Пользователь) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Существующий Из Участники Цикл
		Если Существующий.Пользователь = НовыйУчастник.Пользователь Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;

	Участники.Добавить(НовыйУчастник);

КонецПроцедуры

// Ответственные профиля запуска (ТЧ ar_Ответственные) - источник тот же,
// что в ar_Уведомления.АдресатыИзОтветственных.
//
Процедура ДобавитьОтветственныхПрофиля(Участники, Знач Профиль)

	Если Не ЗначениеЗаполнено(Профиль) Или Не ОбщегоНазначения.СсылкаСуществует(Профиль) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ответственные.ar_Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.ar_ПрофилиЗапуска.ar_Ответственные КАК Ответственные
		|ГДЕ
		|	Ответственные.Ссылка = &Профиль
		|	И Ответственные.ar_Пользователь <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Профиль", Профиль);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьБезДублей(Участники, Участник(Выборка.Пользователь,
			Перечисления.ar_ОснованияУчастияВДиалоге.ОтветственныйПрофиля));
	КонецЦикла;

КонецПроцедуры

// Администраторы ИБ (полные права) - тот же обход, что в
// ar_Уведомления.АдресатыАдминистраторов, но возвращает пользователей справочника.
//
Процедура ДобавитьАдминистраторов(Участники)

	РольПолныеПрава = Метаданные.Роли.ПолныеПрава;

	Для Каждого ОписаниеПользователя Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл

		Если Не ОписаниеПользователя.Роли.Содержит(РольПолныеПрава) Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			СсылкаПользователя = Пользователи.НайтиПоИдентификатору(
				ОписаниеПользователя.УникальныйИдентификатор);
		Исключение
			Продолжить;
		КонецПопытки;

		Если ЗначениеЗаполнено(СсылкаПользователя) Тогда
			ДобавитьБезДублей(Участники, Участник(СсылкаПользователя,
				Перечисления.ar_ОснованияУчастияВДиалоге.Администратор));
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Метаданные объекта по ссылке (для проверки реквизитов предмета).
//
Функция МетаданныеПоСсылке(Знач Ссылка)

	Попытка
		Возврат Ссылка.Метаданные();
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

// Значение структуры параметров с дефолтом.
//
Функция ПараметрДиалога(Знач ПараметрыДиалога, Знач Ключ, Знач Дефолт)

	Если ТипЗнч(ПараметрыДиалога) <> Тип("Структура") Тогда
		Возврат Дефолт;
	КонецЕсли;

	Значение = Дефолт;
	ПараметрыДиалога.Свойство(Ключ, Значение);
	Возврат Значение;

КонецФункции

// Значение структуры записи с дефолтом.
//
Функция ПараметрЗаписи(Знач ПараметрыЗаписи, Знач Ключ, Знач Дефолт)

	Если ТипЗнч(ПараметрыЗаписи) <> Тип("Структура") Тогда
		Возврат Дефолт;
	КонецЕсли;

	Значение = Дефолт;
	ПараметрыЗаписи.Свойство(Ключ, Значение);
	Возврат Значение;

КонецФункции

// CSS-класс сообщения по виду (подсветка вопросов и ответов).
//
Функция КлассСообщения(Знач ВидСообщения)

	Если ВидСообщения = Перечисления.ar_ВидыСообщенийДиалога.Вопрос Тогда
		Возврат "question";
	ИначеЕсли ВидСообщения = Перечисления.ar_ВидыСообщенийДиалога.Ответ Тогда
		Возврат "answer";
	ИначеЕсли ВидСообщения = Перечисления.ar_ВидыСообщенийДиалога.Служебное Тогда
		Возврат "service";
	КонецЕсли;
	Возврат "";

КонецФункции

// Представление вида сообщения (автор по умолчанию).
//
Функция НаименованиеВида(Знач ВидСообщения)

	Если ВидСообщения = Перечисления.ar_ВидыСообщенийДиалога.Вопрос Тогда
		Возврат НСтр("ru='Вопрос агента'; en='Agent question'");
	ИначеЕсли ВидСообщения = Перечисления.ar_ВидыСообщенийДиалога.СообщениеАгента Тогда
		Возврат НСтр("ru='Агент'; en='Agent'");
	ИначеЕсли ВидСообщения = Перечисления.ar_ВидыСообщенийДиалога.РезультатИнструмента Тогда
		Возврат НСтр("ru='Инструмент'; en='Tool'");
	ИначеЕсли ВидСообщения = Перечисления.ar_ВидыСообщенийДиалога.Служебное Тогда
		Возврат НСтр("ru='Служебное'; en='Service'");
	КонецЕсли;
	Возврат НСтр("ru='Пользователь'; en='User'");

КонецФункции

// Экранирование текста сообщения для HTML (текст строится только ядром).
//
Функция ЭкранироватьHTML(Знач Текст)

	Результат = Строка(Текст);
	Результат = СтрЗаменить(Результат, "&", "&amp;");
	Результат = СтрЗаменить(Результат, "<", "&lt;");
	Результат = СтрЗаменить(Результат, ">", "&gt;");
	Результат = СтрЗаменить(Результат, """", "&quot;");
	Возврат Результат;

КонецФункции

// Записать ошибку в журнал регистрации.
//
Процедура ЗаписатьОшибкуЖурнал(Знач Текст)

	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'AgentRunner.Диалоги'; en = 'AgentRunner.Dialogs'"),
		УровеньЖурналаРегистрации.Ошибка,,, Текст);

КонецПроцедуры

#КонецОбласти
